app/Services/CartService.php

select * from `products` where `products`.`id` = 108 limit 1
select `id`, `name`, `price` from `products` where `id` = 108
select `quantity` from `carts` where `product_id` = 108
---
  public static function getItemsInCart($items)
  {
    $products = [];

    //dd($items);
    foreach($items as $item) {
      $p = Products::findOrFail($item->product_id);
      $owner = $p->shop->owner->select('name', 'email')->first()->toArray();//オーナー情報
      $values = array_values($owner);//連想配列の値を取得
      $keys = ['ownerName', 'email'];
      $ownerInfo = array_combine($keys, $values);
      //dd($ownerInfo);
      $products = Products::where('id', $item->product_id)
                 ->select('id', 'name', 'price')->get()->toArray();//商品情報の配列
      $quantity = Cart::where('product_id', $item->product_id)
                  ->select('quantity')->get()->toArray();//在庫数の配列