app/Http/Controllers/User/CartController.php

    public function index()
    {
        $user = User::findOrFail(Auth::id());
---
select * from `users` where `users`.`id` = 1 limit 1

    public function add(Request $request)
    {
        $itemInCart = Cart::where('product_id', $request->product_id)
        ->where('user_id', Auth::id())->first();

        if($itemInCart) {
            $itemInCart->quantity += $request->quantity;
            $itemInCart->save();
        } else {
            Cart::create([
                'user_id' => Auth::id(),
                'product_id' => $request->product_id,
                'quantity' => $request->quantity
            ]);
---
select `products`.*, `carts`.`user_id` as `pivot_user_id`, `carts`.`product_id` as `pivot_product_id`, `carts`.`id` as `pivot_id`, `carts`.`quantity` as `pivot_quantity` from `products` inner join `carts` on `products`.`id` = `carts`.`product_id` where `carts`.`user_id` = 1
select * from `carts` where `product_id` = '168' and `user_id` = 1 limit 1
insert into `carts` (`user_id`, `product_id`, `quantity`, `updated_at`, `created_at`) values (1, '168', '1', '2024-06-28 00:30:37', '2024-06-28 00:30:37')

    public function delete($id)
    {
        Cart::where('product_id', $id)
        ->where('user_id', Auth::id())
        ->delete();
---
delete from `carts` where `product_id` = '168' and `user_id` = 1

    public function checkout()
    {
        $user = User::findOrFail(Auth::id());
        $products = $user->products;

        $lineItems = [];
        foreach($products as $product) {
            $quantity = '';
            $quantity = Stock::where('product_id', $product->id)->sum('quantity');
---
select * from `users` where `users`.`id` = 1 limit 1
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 108

        }
        //dd('yyy');
        foreach($products as $product) {
            Stock::create([
                'product_id' => $product->id,
                'type' => Common::PRODUCT_LIST['reduce'],
                'quantity' => $product->pivot->quantity * -1
            ]);
---
insert into `t_stocks` (`product_id`, `type`, `quantity`, `updated_at`, `created_at`) values (108, '2', -1, '2024-06-28 01:40:17', '2024-06-28 01:40:17')

    public function success()
    {
        ////
        $items = Cart::where('user_id', Auth::id())->get();
        $products = CartService::getItemsInCart($items);
        //dd($products);
        $user = User::findOrFail(Auth::id());

        SendThanksMail::dispatch($products, $user);
        foreach($products as $product) {
            SendOrderedMail::dispatch($product, $user);
        }
        //dd('ユーザーメール送信テスト');

        ////

        Cart::where('user_id', Auth::id())->delete();
---
select * from `carts` where `user_id` = 1
select * from `users` where `users`.`id` = 1 limit 1
delete from `carts` where `user_id` = 1