app/Http/Controllers/User/ItemController.php

    public function index(Request $request)
    {
        //dd($request);

        //非同期送信
         //SendThanksMail::dispatch();

        $categories = PrimaryCategory::with('secondary')
        ->get();
---
select * from `primary_categories`

    public function show($id)
    {
        $product = Products::findOrFail($id);
        $quantity = Stock::where('product_id', $product->id)->sum('quantity');
---
select * from `products` where `products`.`id` = '174' limit 1
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 174